Revit 2027 API
BuiltInFailures.RebarCouplerFailures.MainEngagementParameterWarning Property
 This is used to post warning. "Bar Engagement 1" has an incorrect value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MainEngagementParameterWarning { get; }
Public Shared ReadOnly Property MainEngagementParameterWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MainEngagementParameterWarning {
	FailureDefinitionId^ get ();
}
static member MainEngagementParameterWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace